Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: There is support for automatically finding and adding input devices in ``/dev/input/``.
it_it: È disponibile il supporto per la ricerca e l'aggiunta automatica di dispositivi di input in ``/dev/input/``.

source: There may be a better solution for this, but for the moment the recommendation is to make local modifications to the LVGL component in your espressif project.
it_it: Potrebbe esserci una soluzione migliore, ma per il momento si consiglia di apportare modifiche locali al componente LVGL nel progetto Espressif.

source: There must be one empty line between the code block directive and the code.
it_it: Deve esserci una riga vuota tra la direttiva del blocco di codice e il codice.

source: There should be two serial ports created upon connecting your Alif board.
it_it: Dovrebbero essere create due porte seriali al momento della connessione della scheda Alif.

source: There's a struct that contains a field called ``void * user_data``
it_it: Esiste una struttura che contiene un campo chiamato ``void * user_data``

source: There, you will find many platform-specific descriptions e.g. for ESP32, Arduino, NXP, RT-Thread, NuttX, etc.
it_it: Lì si troveranno molte descrizioni specifiche per ogni piattaforma, ad esempio per ESP32, Arduino, NXP, RT-Thread, NuttX, ecc.

source: Thereafter #include "lvgl/lvgl.h" in source files wherever you need to use LVGL functions.
it_it: Dopodiché ``#include "lvgl/lvgl.h"`` nei sorgenti ovunque ci sia bisogno di utilizzare le funzioni LVGL.

source: Thereafter the Observer will receive a notification each time the Subject's value changes, as long as that Observer remains attached (subscribed) to that Subject.
it_it: Successivamente, l'Observer riceverà una notifica ogni volta che il valore del Subject cambia, finché l'Observer rimane associato (iscritto) a quel Subject.

source: Therefore in direct mode only the whole frame buffer can be rotated.
it_it: Pertanto, in modalità diretta è possibile ruotare solo l'intero frame buffer.

source: Therefore in the MicroPython binding we need to register both a function pointer and a MicroPython object for every callback.
it_it: Pertanto, nel binding MicroPython dobbiamo registrare sia un puntatore a funzione che un oggetto MicroPython per ogni callback.

source: Therefore indexed images (``LV_COLOR_FORMAT_I1/2/4/8_...``) and alpha only images cannot be transformed.
it_it: Pertanto, le immagini indicizzate (``LV_COLOR_FORMAT_I1/2/4/8_...``) e le immagini solo alfa non possono essere trasformate.

source: Therefore we defined a **callback convention** for the LVGL C API that expects LVGL headers to be defined in a certain way.
it_it: Abbiamo quindi definito una **convenzione di callback** per l'API C LVGL che prevede che gli header LVGL siano definiti in un certo modo.

source: Therefore when cloning the latest versions of the supported LVGL board repositories, recursive updating of the git submodules is no longer needed.
it_it: Pertanto, quando si clonano le ultime versioni dei repository delle board che supportano LVGL, non è più necessario l'aggiornamento ricorsivo dei sottomoduli git.

source: Therefore, LVGL caches image data.
it_it: Pertanto, LVGL memorizza nella cache i dati delle immagini.

source: Therefore, LVGL cannot accept GPL licensed code.
it_it: Pertanto, LVGL non può accettare codice con licenza GPL.

source: Therefore, LVGL contains built-in support for `Dave2D <https://www.renesas.com/document/mas/tes-dave2d-driver-documentation>`__ (the GPU of Renesas) and we also maintain ready-to-use Renesas projects.
it_it: Pertanto, LVGL include il supporto nativo per `Dave2D <https://www.renesas.com/document/mas/tes-dave2d-driver-documentation>`__ (la GPU di Renesas) e gestiamo anche progetti Renesas pronti all'uso.

source: Therefore, it can be set directly on the :cpp:enumerator:`LV_PART_SCROLLBAR` part of a Widget, or on the Widget's LV_PART_MAIN part, or that of any of its parents, to make a scrollbar inherit the base direction.
it_it: Pertanto, può essere impostato direttamente sulla parte :cpp:enumerator:`LV_PART_SCROLLBAR` di un Widget, o sulla parte LV_PART_MAIN del Widget, o su quella di uno qualsiasi dei suoi elementi padre, per far sì che una barra di scorrimento erediti la direzione di base.

source: Therefore, it cannot accurately measure intervals below 1ms.
it_it: Pertanto, non può misurare con precisione intervalli inferiori a 1 ms.

source: Therefore, it is recommended to compress only the largest fonts of a user interface, because
it_it: Pertanto, si consiglia di comprimere solo i font più grandi di un'interfaccia utente, perché

source: Therefore, it's important to use the fastest memory (e.g., ``BSS`` or ``TCM``) for LVGL's buffer to avoid memory bandwidth bottlenecks.
it_it: Pertanto, è importante utilizzare la memoria più veloce (ad esempio, ``BSS`` o ``TCM``) per il buffer di LVGL per evitare colli di bottiglia nella larghezza di banda della memoria.

source: Therefore, it's the user's responsibility to be sure there is enough RAM to cache even the largest images at the same time.
it_it: Pertanto, è responsabilità dell'utente assicurarsi che ci sia abbastanza RAM per memorizzare nella cache anche le immagini più grandi contemporaneamente.

source: Therefore, local draw descriptor variables can be safely used.
it_it: Pertanto, le variabili locali del descrittore di disegno possono essere utilizzate in modo sicuro.

source: Therefore, not all properties have to be specified in a style.
it_it: Pertanto, non tutte le proprietà devono essere specificate in uno stile.

source: Therefore, some symbols need to be included in configuration files:
it_it: Pertanto, alcuni simboli devono essere inclusi nei file di configurazione:

source: Therefore, the functions and functionalities of the Base Widget can be used with other widgets as well.
it_it: Pertanto, le funzioni e le funzionalità del Widget Base possono essere utilizzate anche con gli altri Widget.

source: Therefore, the next or previous object will be selected by turning the encoder.
it_it: Pertanto, l'oggetto successivo o precedente verrà selezionato ruotando l'encoder.

source: Therefore, tiling is not visible from the flushing point of view.
it_it: Pertanto, il tiling non è visibile dal punto di vista del flushing.

source: Therefore, updated areas will:
it_it: Pertanto, le aree aggiornate:

source: Therefore, you can call any LVGL-related function in a Timer.
it_it: Pertanto, è possibile chiamare qualsiasi funzione relativa a LVGL in un Timer.

source: Therefore, you don't need to keep the text you pass to :cpp:func:`lv_label_set_text` in scope after that function returns.
it_it: Pertanto, non è necessario mantenere il testo passato a :cpp:func:`lv_label_set_text` nello scope dopo il ritorno della funzione.

source: Therefore, you should only specify ``true`` on the first call when calling this method multiple times in a row.
it_it: Pertanto, è consigliabile specificare ``true`` solo alla prima chiamata quando si richiama questo metodo più volte di seguito.

source: These "typical background properties" are the properties being referred to:
it_it: Queste "proprietà tipiche del background" sono le proprietà a cui si fa riferimento:

source: These are **not** exported to code and are **not** loaded from XML.
it_it: Questi **non** vengono esportati nel codice e **non** vengono caricati da XML.

source: These are PCs which are designed to be mounted in a panel.
it_it: Si tratta di PC progettati per essere montati su un pannello.

source: These are always **absolute coordinates** on the display.
it_it: Queste sono sempre **coordinate assolute** sul display.

source: These are called "stops".
it_it: Questi sono chiamati "stop".

source: These are covered in :ref:`common_widget_features`.
it_it: Queste sono trattate in :ref:`common_widget_features`.

source: These are included with the library under the ``examples`` and ``demos`` folders.
it_it: Questi sono inclusi nella libreria nelle cartelle ``examples`` e ``demos``.

source: These are independent of XML, but XML components rely on them.
it_it: Questi sono indipendenti dall'XML, ma i componenti XML si basano su di essi.

source: These are missing from the demo when it is run with the NeoChrom driver.
it_it: Questi elementi non sono presenti nella demo quando viene eseguita con il driver NeoChrom.

source: These are relevant if a new Widget is implemented and it uses custom drawing.
it_it: Questi sono rilevanti se viene implementato un nuovo Widget che utilizza un disegno personalizzato.

source: These are the possible sorting methods:
it_it: Ecco i possibili metodi di ordinamento:

source: These are used when registering callback functions in LVGL.
it_it: Questi vengono utilizzati per la registrazione di funzioni di callback in LVGL.

source: These are usually stored within a project as a C file generated by one of these two LVGL image converters:
it_it: Questi vengono solitamente memorizzati all'interno di un progetto come file C generato da uno di questi due convertitori di immagini LVGL:

source: These artifacts include kernel images, root filesystems, packages, SDKs, bootloader files, and other components that are generated during the Yocto build process.
it_it: Questi artefatti includono immagini del kernel, file system di root, pacchetti, SDK, file del bootloader e altri componenti generati durante il processo di build di Yocto.

source: These bindings use attributes that start with ``bind_*`` and reference a subject.
it_it: Questi "binding" [collegamenti] utilizzano attributi che iniziano con ``bind_*`` e fanno riferimento a un soggetto.

source: These boards and modules are designed to meet the needs of industrial and commercial applications, offering reliability, longevity, and scalability.
it_it: Queste schede e moduli sono progettati per soddisfare le esigenze di applicazioni industriali e commerciali, offrendo affidabilità, longevità e scalabilità.

source: These can later be installed on the target device using package management tools
it_it: Possono essere successivamente installati sul dispositivo di destinazione utilizzando gli strumenti di gestione dei pacchetti.

source: These can, for example, be used if you do not want any padding between Widgets: :cpp:expr:`lv_style_set_pad_column(&row_container_style, 0)`
it_it: Possono essere utilizzati, ad esempio, se non si desidera alcun padding tra i Widgets: :cpp:expr:`lv_style_set_pad_column(&row_container_style, 0)`

source: These commands create the project directory and the ``Dockerfile``.
it_it: Questi comandi creano la directory del progetto e il ``Dockerfile``.

source: These commands provide a common interface to configure display orientation, color resolution, various power modes, and provide generic video memory access.
it_it: Questi comandi forniscono un'interfaccia comune per configurare l'orientamento del display, la risoluzione del colore, varie modalità di alimentazione e forniscono l'accesso generico alla memoria video.

source: These components share a common public API, making it easy to migrate your projects across different display and touch drivers.
it_it: Questi componenti condividono un'API pubblica comune, semplificando la migrazione dei progetti tra diversi driver di display e touch.

source: These cores are at the heart of many embedded systems, powering chips from industry giants such as STMicroelectronics, NXP, and Renesas.
it_it: Questi core sono il cuore di molti sistemi embedded e alimentano chip di giganti del settore come STMicroelectronics, NXP e Renesas.

source: These demo projects use Espressif's Board Support Packages (BSPs).
it_it: Questi progetti demo utilizzano i Board Support Package (BSP) di Espressif.

source: These displays are still low-profile so they can be embedded into custom fixtures with ease.
it_it: Questi display hanno comunque un profilo basso, quindi possono essere integrati facilmente in dispositivi personalizzati.

source: These do not need this escaping:
it_it: Queste non necessitano di questo escape:

source: These drivers need to be added to project:
it_it: Questi driver devono essere aggiunti al progetto:

source: These event timestamps serve in measurements taken in performance analysis.
it_it: Questi timestamp degli eventi vengono utilizzati nelle misurazioni effettuate durante l'analisi delle prestazioni.

source: These events can be added as children of any widget.
it_it: Questi eventi possono essere aggiunti come elementi figli di qualsiasi widget.

source: These files fall into several areas that define machine configuration options, distribution configuration options, compiler tuning options, general common configuration options, and user configuration options in ``conf/local.conf``, which is found in the `Build Directory <https://docs.
it_it: Questi file rientrano in diverse aree che definiscono le opzioni di configurazione della macchina, le opzioni di configurazione della distribuzione, le opzioni di ottimizzazione del compilatore, le opzioni di configurazione comuni generali e le opzioni di configurazione utente in ``conf/local.conf``, che si trova nella `Build Directory <https://docs.

source: These flags can be added/removed with :cpp:expr:`lv_obj_add_flag(widget, FLAG)` and :cpp:expr:`lv_obj_remove_flag(widget, FLAG)`
it_it: Questi flag possono essere aggiunti/rimossi con :cpp:expr:`lv_obj_add_flag(widget, FLAG)` e :cpp:expr:`lv_obj_remove_flag(widget, FLAG)`

source: These functions can be called in any order, any number of times.
it_it: Queste funzioni possono essere chiamate in qualsiasi ordine e un numero qualsiasi di volte.

source: These functions can be easily used in any test framework (such as Unity, GoogleTest, etc.), and assertions can be performed to check if, for example:
it_it: Queste funzioni possono essere facilmente utilizzate in qualsiasi framework di test (come Unity, GoogleTest, ecc.) e le asserzioni possono essere eseguite per verificare, ad esempio:

source: These functions have the following parameters:
it_it: Queste funzioni hanno i seguenti parametri:

source: These functions set the given subject (integer or string) to a fixed value when the specified trigger event occurs.
it_it: Queste funzioni impostano l'oggetto specificato (intero o stringa) su un valore fisso quando si verifica l'evento trigger specificato.

source: These instructions describe the main ``lvgl`` repository but it works the same way any remote Git repository.
it_it: Queste istruzioni descrivono il repository principale ``lvgl``, ma funzionano allo stesso modo di qualsiasi repository Git remoto.

source: These layer work areas are returned to the heap once rendering is complete.
it_it: Queste aree di lavoro vengono restituite all'heap al termine del rendering.

source: These layers work like any other Widget, meaning they have styles, and any kind of Widgets can be created in them.
it_it: Questi layer funzionano come qualsiasi altro widget, ovvero hanno stili e al loro interno è possibile creare qualsiasi tipo di Widget.

source: These options can be selected in the `LVGL Online Image Converter`_.
it_it: Queste opzioni possono essere selezionate nell'`LVGL Online Image Converter`_.

source: These options can reside on the IDF project `sdkconfig.defaults`, the last option
it_it: Queste opzioni possono risiedere nel progetto IDF `sdkconfig.defaults`, l'ultima opzione.

source: These packages are typically created when you're building your Yocto project with package management support enabled.
it_it: Questi pacchetti vengono in genere creati durante la compilazione del progetto Yocto con il supporto per la gestione dei pacchetti abilitato.

source: These parameters were taken from the collection of configs provided by the EVE library supporting this renderer.
it_it: Questi parametri sono stati presi dalla raccolta di configurazioni fornita dalla libreria EVE che supporta questo renderer.

source: These projects use the :ref:`sdl_driver`.
it_it: Questi progetti utilizzano :ref:`sdl_driver`.

source: These properties are set once (at creation time), and there are no specific ``set`` functions to modify the property later.
it_it: Queste proprietà vengono impostate una sola volta (al momento della creazione) e non ci sono funzioni ``set`` specifiche per modificarle in seguito.

source: These properties can be easily copy-pasted as style attributes in the Editor, enabling pixel-perfect design implementation.
it_it: Queste proprietà possono essere facilmente copiate e incollate nell'Editor come attributi di stile, consentendo un'implementazione di design pixel-perfect.

source: These properties can then be passed to any properties of the children by referencing them using ``$``.
it_it: Queste proprietà possono quindi essere passate a qualsiasi proprietà dei figli facendo riferimento ad esse tramite ``$``.

source: These properties have this effect only on the ``MAIN`` part of the widget.
it_it: Queste proprietà hanno questo effetto solo sulla parte ``MAIN`` del widget.

source: These registration functions process the XML data and store relevant information internally.
it_it: Queste funzioni di registrazione elaborano i dati XML e memorizzano internamente le informazioni rilevanti.

source: These restrictions apply regardless of whether the software is commercial, free, or open-source.
it_it: Queste restrizioni si applicano indipendentemente dal fatto che il software sia commerciale, gratuito o open source.

source: These return a translated string which can be used with widgets:
it_it: Questi restituiscono una stringa tradotta che può essere utilizzata con i widget:

source: These shouldn't be modified as they will be overwritten on the next code generation.
it_it: Questi file non devono essere modificati poiché verranno sovrascritti alla successiva generazione di codice.

source: These supply the default implementation for Widget IDs, namely that for each Widget created, :cpp:expr:`lv_obj_stringify_id(widget, buf, len)` will produce a unique string for it.
it_it: Queste forniscono l'implementazione di default per gli ID dei Widget, ovvero che per ogni Widget creato, :cpp:expr:`lv_obj_stringify_id(widget, buf, len)` produrrà una stringa univoca.

source: These templates now include support for LVGL applications, available as one of the `partner templates <https://github.com/torizon/vscode-torizon-templates?tab=readme-ov-file#partner-templates>`_.
it_it: Questi template ora includono il supporto per le applicazioni LVGL, disponibili come uno dei `template partner <https://github.com/torizon/vscode-torizon-templates?tab=readme-ov-file#partner-templates>`_.

source: These tiles are independent, making it easier to find areas that can be rendered concurrently.
it_it: Questi riquadri sono indipendenti, rendendo più facile trovare aree che possono essere renderizzate contemporaneamente.

source: These too must be in the range [0..255].
it_it: Anche questi devono essere compresi nell'intervallo [0..255].

source: These tools together allow developers to build UIs effectively, test them in a simple and reliable way, and collaborate with the rest of the team and customers.
it_it: Questi strumenti insieme consentono agli sviluppatori di creare interfacce utente efficaci, testarle in modo semplice e affidabile e collaborare con il resto del team e i clienti.

source: These two LVGL functions may be called from any thread:
it_it: Queste due funzioni LVGL possono essere chiamate da qualsiasi thread:

source: These values are relative to the parent's top-left corner, including the parent’s padding and border.
it_it: Questi valori sono relativi all'angolo in alto a sinistra del genitore, inclusi padding interno e bordo del genitore.

source: These values can be combined, e.g. :cpp:expr:`LV_FREETYPE_FONT_STYLE_BOLD | LV_FREETYPE_FONT_STYLE_ITALIC`.
it_it: Questi valori possono essere combinati, ad esempio :cpp:expr:`LV_FREETYPE_FONT_STYLE_BOLD | LV_FREETYPE_FONT_STYLE_ITALIC`.

source: These values cause the Widget's layout behavior to model `CSS Flexbox`_ behavior by combining flex-direction_ and flex-wrap_ as defined under flex-flow_.
it_it: Questi valori fanno sì che il comportamento del layout del Widget modelli il comportamento di `CSS Flexbox`_ combinando flex-direction_ e flex-wrap_ come definito in flex-flow_.

source: They are DM&P Vortex86 series chips.
it_it: Si tratta di chip DM&P della serie Vortex86.

source: They are a complete solution electrically and mechanically.
it_it: Rappresentano una soluzione completa dal punto di vista elettrico e meccanico.

source: They are both draw units and they will both independently accept draw tasks.
it_it: Sono entrambe unità di disegno e accetteranno attività di disegno in modo indipendente.

source: They are built from Widgets and/or other Components to describe the :ref:`Screen <screens>`.
it_it: Sono costruiti a partire da Widget e/o altri Componenti per descrivere lo :ref:`Screen <screens>`.

source: They are built from Widgets and/or other Components.
it_it: Sono costruiti a partire da Widget e/o altri Componenti.

source: They are built from a content area with a helper to add text, an optional header (which can have a title, a close button, and other buttons), and an optional footer with buttons.
it_it: Sono costituite da un'area di contenuto con un helper per l'aggiunta di testo, un'intestazione facoltativa (che può contenere un titolo, un pulsante di chiusura e altri pulsanti) e un piè di pagina facoltativo con pulsanti.

source: They are defined only in XML and cannot have custom C code (but they can call C functions as event callbacks).
it_it: Sono definiti solo in XML e non possono avere codice C personalizzato (ma possono chiamare funzioni C come callback di eventi).

source: They are described in more detail in the :ref:`Style overview <styles>` section.
it_it: Sono descritte più dettagliatamente nella sezione :ref:`Panoramica sugli Stili <styles>`.

source: They are fully responsive.
it_it: Sono completamente responsive.

source: They are mainly from the LVGL documentation examples.
it_it: Provengono principalmente dagli esempi della documentazione di LVGL.

source: They are more powerful than typical HMIs.
it_it: Sono più potenti dei tipici HMI.

source: They are not complete guides, but include notes on the necessary libraries, compile flags, etc.
it_it: Non si tratta di guide complete, ma includono note sulle librerie necessarie, i flag di compilazione, ecc.

source: They are prioritized as follows (from most to least verbose):
it_it: Sono ordinati come segue (dal più dettagliato al meno dettagliato):

source: They are programmed with the Arduino IDE.
it_it: Sono programmati con l'IDE Arduino.

source: They are ready-to-use industrial PCs.
it_it: Sono PC industriali pronti all'uso.

source: They are similar to LVGL's built-in widgets.
it_it: Sono simili ai widget nativi di LVGL.

source: They are used only by the UI |nbsp| Editor to describe the context of the Component.
it_it: Vengono utilizzati solo dall'Editor dell'Interfaccia Utente per descrivere il contesto del Componente.

source: They are useful for semantic purposes and have slightly different default settings.
it_it: Sono utili per scopi semantici e hanno impostazioni di default leggermente diverse.

source: They are useful to add local customization to a Widget.
it_it: Sono utili per aggiungere personalizzazioni locali a un widget.

source: They are wrappers around ``EVE_memRead8()``, etc.
it_it: Sono wrapper per ``EVE_memRead8()``, ecc.

source: They can be compound, containing other Widgets (e.g., ``Tabview``'s tabs, ``Dropdown``'s lists).
it_it: Possono essere composti, ovvero contenere altri widget (ad esempio, i tab delle ``Tabview``, le liste delle ``Dropdown``).

source: They can be different values.
it_it: Possono essere valori diversi.
